cf_billing/DataProcessors/бестМассовыйВводЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестМассовыйВводЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобственностиЖилья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСобственниковЖилья</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПодключенияУслуги</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПрибораУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргМестаРасположенияТочекУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргФилиалыСтроений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФилиалыСтроений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргАбоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агентский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домовладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальноеОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМуниципальноеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнутрРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГород</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПрописки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыАбонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНасПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРайонАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУлица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPабонент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЕИРЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/бестМассовыйВводЛицевыхСчетов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьДокумент(Команда)
	//нДок = ПолучитьДокумент();
	Форма = ПолучитьФорму("Документ.энргВводНачальныхОстатков.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДокументНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьДокументНаСервере(ДанныеФормы)
	Группа 		= Объект.ГруппаАбонента;
	ДлинаЛС 	= энргРаботаСЛицевымСчетомСервер.ПолучитьДлинуЛС(ТекущаяДата(), Объект.Организация);
	МаксНомер 	= ПолучитьМаксНомер(Группа, Объект.Район, Объект.Организация, ДлинаЛС);
			
	// Шапка документа.
	ДанныеФормы.Организация = Объект.Организация;
	ДанныеФормы.МКД 		= Объект.МКД;
	ДанныеФормы.Район 		= Объект.Район;
	ДанныеФормы.Филиал 		= РегистрыСведений.энргФилиалыСтроений.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Строение",Объект.МКД)).Филиал;
	МассивПомещений 		= ПолучитьПомещения(Объект.МКД);	
	
	Для й=1 По КвартираДо - КвартираОт + 1 Цикл
		
		КодАбонента 	= Формат(Число(МаксНомер) + й,"ЧГ=0");
		Пока Группа.Уровень() > 1 Цикл
			Группа = Группа.Родитель;
		КонецЦикла;
		КодРайона 		= ?(ЗначениеЗаполнено(Группа.КодРайона),Группа.КодРайона, "00");
		Префикс			= Объект.Район.КодРайона + КодРайона;
		ЛС 				= Префикс + Лев("00000000000000", ДлинаЛС - СтрДлина(Префикс) - СтрДлина(КодАбонента)) + КодАбонента;
		
		// Заполнение ТЧ Абоненты в документе.
		нСтрока 						= ДанныеФормы.Абоненты.Добавить();
		нСтрока.Строение 				= Объект.МКД;
		нСтрока.ЛицевойСчет 			= ЛС;
		нСтрока.ГруппаАбонентов 		= Группа;
		нСтрока.АдресОбъекта 			= Объект.МКД.Наименование + ", квартира " + Формат(Число(КвартираОт-1) + й,"ЧГ=0");
		нСтрока.ДатаОткрытияЛС 			= ТекущаяДата();
		нСтрока.ВидОбъекта 				= Объект.ВидОбъекта;
		нСтрока.IDСтроки 				= Новый УникальныйИдентификатор;
		нСтрока.ТипСобственностиЖилья 	= Объект.ТипСобственностиЖилья;
		нСтрока.Помещение 				= МассивПомещений[й-1];
		
		// Заполнение услуг с типами приборов учета.
		Для каждого ТекСтрока Из Объект.ТочкиУчета Цикл
			нСтрокаТУ 					= ДанныеФормы.ТочкиУчета.Добавить();
			нСтрокаТУ.IDСтроки 			= Новый УникальныйИдентификатор;
			нСтрокаТУ.Услуга 			= ТекСтрока.Услуга;
			нСтрокаТУ.IDСтрокиАбонента 	= нСтрока.IDСтроки;
			нСтрокаТУ.Расположение		= ТекСтрока.Расположение;
			Если ЗначениеЗаполнено(ТекСтрока.ТипПрибораУчета) Тогда
				нСтрокаТУ.ТипПрибораУчета 	= ТекСтрока.ТипПрибораУчета;
				нСтрокаТУ.ВидКанальности 	= Справочники.энргВидыКанальности.Одноканальный;
			КонецЕсли;
			нСтрокаТУ.Поставщик 					= Справочники.энргКонтрагенты.НайтиПоКоду("000000010");
			нСтрокаТУ.НаименованиеТочки 			= "" + нСтрокаТУ.Расположение + "_" + нСтрокаТУ.Услуга;
			ТекСтрокаПоказания 						= ДанныеФормы.ШкалыПриборовУчета.Добавить();
			ТекСтрокаПоказания.IDСтроки 			= Новый УникальныйИдентификатор;
			ТекСтрокаПоказания.IDСтрокиТочкиУчета 	= нСтрокаТУ.IDСтроки;
		КонецЦикла;
		
		// Заполнение услуг по благоустройству.
		Для каждого ТекСтрока Из Объект.ВидыБлагоустройстваТарифныеКатегории Цикл
			Если ТекСтрока.Услуга.СоставнаяУслуга Тогда
				Для каждого ТекСтрокаУслуг Из ТекСтрока.Услуга.СоставляющиеУслуг Цикл
					нСтрокаУслуги 						= ДанныеФормы.ВидыБлагоустройстваТарифныеКатегории.Добавить();
					ЗаполнитьЗначенияСвойств(нСтрокаУслуги, ТекСтрока); 
					нСтрокаУслуги.Услуга 				= ТекСтрокаУслуг.Услуга;
					нСтрокаУслуги.IDСтрокиАбонента 		= нСтрока.IDСтроки;
				КонецЦикла;
			Иначе
				нСтрокаУслуги 							= ДанныеФормы.ВидыБлагоустройстваТарифныеКатегории.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрокаУслуги, ТекСтрока); 
				нСтрокаУслуги.IDСтрокиАбонента 			= нСтрока.IDСтроки;
			КонецЕсли;	  
		КонецЦикла;
		
	КонецЦикла;  
		
КонецФункции

// Получение последнего номера лицевого счета по заданным параметрам.
&НаСервере
Функция ПолучитьМаксНомер(Группа,Район,Организация, ДлинаЛС)
	Запрос 		= Новый Запрос;
	Запрос.УстановитьПараметр("Район",Район);
	Запрос.УстановитьПараметр("Организация",Организация);
	Текст  ="ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.ЛицевойСчет, ""00000000"") КАК МаксНомер
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ПОДСТРОКА(энргАбоненты.ЛицевойСчет, 5,%%ДлинаЛС%%)) КАК ЛицевойСчет
		|	ИЗ
		|		Справочник.энргАбоненты КАК энргАбоненты
		|	ГДЕ
		|		энргАбоненты.Район  =&район И энргАбоненты.Организация  = &Организация) КАК ВложенныйЗапрос";
	Текст 			= СтрЗаменить(Текст,"%%ДлинаЛС%%",Строка(ДлинаЛС));
	Запрос.Текст 	= Текст;
	Выборка  		= Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	МаксНомер  		= СокрЛП(Выборка.МаксНомер);
	
	Возврат МаксНомер;	
КонецФункции

&НаСервере
// Получение элементов справочника энргПомещения в массив, по количеству квартир
Функция ПолучитьПомещения(Строение)
	МассивПомещений = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргПомещения.Ссылка КАК Ссылка,
		|	энргПомещения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.энргПомещения КАК энргПомещения
		|ГДЕ
		|	энргПомещения.Строение = &Строение
		|
		|СГРУППИРОВАТЬ ПО
		|	энргПомещения.Ссылка,
		|	энргПомещения.Наименование";
	
	Запрос.УстановитьПараметр("Строение", Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для й=КвартираОт По КвартираДо Цикл
			Если СтрНайти(ВыборкаДетальныеЗаписи.Наименование, "Квартира " + й) > 0 Тогда
				МассивПомещений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
				Прервать;
			ИначеЕсли СтрНайти(ВыборкаДетальныеЗаписи.Наименование, "квартира " + й) > 0 Тогда
				МассивПомещений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
				Прервать;
			КонецЕсли;
		КонецЦикла;	 
	КонецЦикла;
	Возврат МассивПомещений;
КонецФункции // ПолучитьПомещение()
 
#КонецОбласти
